{
    "format": "layers-model",
    "generatedBy": "keras v2.8.0",
    "convertedBy": "TensorFlow.js Converter v4.1.0",
    "modelTopology": {
        "keras_version": "2.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                48,
                                48,
                                3
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_1"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 512,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 256,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_1",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.5,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_2",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_2",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_3",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_3",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_1",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.5,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_4",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_2",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_2",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.5,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 4,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "accuracy",
                            "dtype": "float32",
                            "fn": "categorical_accuracy"
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 9.999999747378752e-06,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "batch_normalization/gamma",
                    "shape": [
                        512
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": 0.17313450574874878,
                        "scale": 0.00783161766388837,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization/beta",
                    "shape": [
                        512
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.28974778652191163,
                        "scale": 0.002434855348923627,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization/moving_mean",
                    "shape": [
                        512
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.0,
                        "scale": 0.0039649537965363146,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization/moving_variance",
                    "shape": [
                        512
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": 7.006492321624085e-44,
                        "scale": 0.0008477194636475806,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization_1/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": 0.7018471360206604,
                        "scale": 0.003087170217551437,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization_1/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.1262787828842799,
                        "scale": 0.0021403183539708457,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization_1/moving_mean",
                    "shape": [
                        256
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": 7.006492321624085e-44,
                        "scale": 0.02382073308907303,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization_1/moving_variance",
                    "shape": [
                        256
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": 7.006492321624085e-44,
                        "scale": 0.11693305969238281,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization_2/gamma",
                    "shape": [
                        128
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": 0.6382859349250793,
                        "scale": 0.0036719530236487296,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization_2/beta",
                    "shape": [
                        128
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.1778387356622546,
                        "scale": 0.001833389027445924,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization_2/moving_mean",
                    "shape": [
                        128
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": 0.32415691018104553,
                        "scale": 0.052917487364189296,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization_2/moving_variance",
                    "shape": [
                        128
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": 2.2329511642456055,
                        "scale": 1.7739941952275295,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization_3/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": 0.4560963213443756,
                        "scale": 0.001154550033457139,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization_3/beta",
                    "shape": [
                        64
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.0021817071322242127,
                        "scale": 0.0007272357107414042,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization_3/moving_mean",
                    "shape": [
                        64
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": 0.9420011043548584,
                        "scale": 0.012045941633336684,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "batch_normalization_3/moving_variance",
                    "shape": [
                        64
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": 15.714730262756348,
                        "scale": 0.3501507590798771,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "conv2d/kernel",
                    "shape": [
                        3,
                        3,
                        3,
                        512
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.2932412277249729,
                        "scale": 0.0029620326032825544,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "conv2d/bias",
                    "shape": [
                        512
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.04798633467917349,
                        "scale": 0.000922814128445644,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "conv2d_1/kernel",
                    "shape": [
                        3,
                        3,
                        512,
                        256
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.7271754846853369,
                        "scale": 0.005386485071743236,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "conv2d_1/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.25353648557382474,
                        "scale": 0.0015650400344063254,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "conv2d_2/kernel",
                    "shape": [
                        3,
                        3,
                        256,
                        128
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.6267840911360348,
                        "scale": 0.004293041720109828,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "conv2d_2/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.5712738585822722,
                        "scale": 0.0026085564318825217,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "conv2d_3/kernel",
                    "shape": [
                        3,
                        3,
                        128,
                        64
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.5091936906178792,
                        "scale": 0.0037440712545432297,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "conv2d_3/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.29603102423396765,
                        "scale": 0.0017111619897917205,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "conv2d_4/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        32
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.5010762831744026,
                        "scale": 0.0032120274562461703,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "conv2d_4/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.4468892812728882,
                        "scale": 0.0016395547153318629,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "dense/kernel",
                    "shape": [
                        1152,
                        4
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.2933876917642706,
                        "scale": 0.0023471015341141647,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "dense/bias",
                    "shape": [
                        4
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.37468891003552607,
                        "scale": 0.0037847364650053137,
                        "original_dtype": "float32"
                    }
                }
            ]
        }
    ]
}